<?php

namespace Database\Seeders;

use App\Models\PregnancyCategory;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class PregnancyCategorySeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $payload = [
            ['name' => 'A', 'description' => 'গর্ভবতী মহিলাদের মধ্যে পর্যাপ্ত, সুনিয়ন্ত্রিত অধ্যয়নগুলি গর্ভাবস্থার কোনও ত্রৈমাসিকে ভ্রূণের অস্বাভাবিকতার বর্ধিত ঝুঁকি দেখায়নি'],
            ['name' => 'B', 'description' => 'প্রাণীর গবেষণায় ভ্রূণের ক্ষতির কোনো প্রমাণ পাওয়া যায়নি, তবে গর্ভবতী মহিলাদের ক্ষেত্রে পর্যাপ্ত এবং সুনিয়ন্ত্রিত গবেষণা নেই। বা পশুর অধ্যয়নগুলি একটি বিরূপ প্রভাব দেখিয়েছে, কিন্তু গর্ভবতী মহিলাদের মধ্যে পর্যাপ্ত এবং সুনিয়ন্ত্রিত অধ্যয়নগুলি কোনও ত্রৈমাসিকে ভ্রূণের ঝুঁকি প্রদর্শন করতে ব্যর্থ হয়েছে৷'],
            ['name' => 'C', 'description' => 'পশুদের গবেষণায় একটি বিরূপ প্রভাব দেখানো হয়েছে এবং গর্ভবতী মহিলাদের মধ্যে কোন পর্যাপ্ত এবং সুনিয়ন্ত্রিত গবেষণা নেই। বা কোন প্রাণী গবেষণা পরিচালিত হয়নি এবং গর্ভবতী মহিলাদের মধ্যে কোন পর্যাপ্ত এবং সুনিয়ন্ত্রিত গবেষণা নেই।'],
            ['name' => 'D', 'description' => 'গর্ভবতী মহিলাদের মধ্যে পর্যাপ্ত ভাল-নিয়ন্ত্রিত বা পর্যবেক্ষণমূলক গবেষণা ভ্রূণের জন্য একটি ঝুঁকি প্রদর্শন করেছে। যাইহোক, থেরাপির সুবিধাগুলি সম্ভাব্য ঝুঁকির চেয়ে বেশি হতে পারে। উদাহরণস্বরূপ, একটি জীবন-হুমকির পরিস্থিতি বা গুরুতর রোগের প্রয়োজনে ওষুধ গ্রহণযোগ্য হতে পারে যার জন্য নিরাপদ ওষুধ ব্যবহার করা যায় না বা অকার্যকর।'],
            ['name' => 'X', 'description' => 'পশু বা গর্ভবতী মহিলাদের মধ্যে পর্যাপ্ত সুনিয়ন্ত্রিত বা পর্যবেক্ষণমূলক গবেষণায় ভ্রূণের অস্বাভাবিকতা বা ঝুঁকির ইতিবাচক প্রমাণ দেখা গেছে। গর্ভবতী বা গর্ভবতী হতে পারে এমন মহিলাদের ক্ষেত্রে পণ্যটির ব্যবহার নিষিদ্ধ।'],
        ];

        foreach ($payload as $item){
            PregnancyCategory::create($item);
        }
    }
}
